In [1]:
import pandas as pd 
import csv

### ANS 1
1) describe 
2) index 
3) Categorical
4) max 
5) min

In [43]:
df=pd.read_csv('player.csv')

In [44]:
df.describe()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
count,675,675,675,675,675,675,675,675,675,675,...,650,675,675,675,675,675,675,675,675,675
unique,493,493,12,21,32,84,81,557,327,458,...,275,165,293,350,249,119,98,177,214,463
top,Rk,Player,SG,23,TOT,82,0,MP,FG,FGA,...,.500,1,DRB,TRB,AST,0,0,TOV,PF,PTS
freq,24,24,145,86,76,27,179,24,24,24,...,29,30,24,24,24,29,88,24,24,24

In [7]:
df[['Rk','Player']].index

RangeIndex(start=0, stop=675, step=1)

In [8]:
pd.Categorical(df['Rk'])

['1', '2', '3', '4', '5', ..., '490', '490', '490', '491', '492']
Length: 675
Categories (493, object): ['1', '10', '100', '101', ..., '97', '98', '99', 'Rk']

In [45]:
df['Age'].max()

'Age'

In [16]:
min(df['Age'])

'19'

### ANS 6
df.read_excel is used to read the excel file

In [19]:
pf=pd.read_excel('a.xlsx')

### ANS 13
pandas library should be imported first to process the necessary fucntion

### ANS 3

In [264]:
pf1=pd.read_csv('data_1.csv')

In [265]:
pf1

     Name  values  Gender
0  Allice      25  Female
1     bob      30    male
2  claire      27  female
3     bob      54    male

In [266]:
pf1['values']

0    25
1    30
2    27
3    54
Name: values, dtype: int64

In [267]:
s=pf1['values']

In [268]:
def plus(s):
    sum=0
    for i in s[:3]:
        sum+=i
    return(sum)

In [269]:
plus(s)

82

### OR

In [52]:
s1=pf1['values'][:3]

In [53]:
s1.sum()

82

### ANS 7

In [90]:
email=[['sr.no','email'],
       [1,'aman@gmail.com'],
       [2,'shomiya@gmail.com'],
       [3,'deepak@gmail.com']
      ]

In [91]:
with open('email.csv','w') as f:
    writer=csv.writer(f) 
    
    for i in email:
        writer.writerow(i)

In [36]:
pf2=pd.read_csv('email.csv')

In [38]:
pf2['email']

0       aman@gmail.com
1    shomiya@gmail.com
2     deepak@gmail.com
Name: email, dtype: object

In [93]:
s=pf2['email']

In [100]:
l=[]
for i in s:
    l.append(i)

In [107]:
l2=[]
for i in l:
    i=i.replace('@gmail.com','')
    l2.append(i)

In [110]:
pf2['username']=l2

In [111]:
pf2

   sr.no              email username
0      1     aman@gmail.com     aman
1      2  shomiya@gmail.com  shomiya
2      3   deepak@gmail.com   deepak

### OR

In [ ]:
s=pf2['email']
def re(s):
    return(s[:-10])
pf2['username']=s.apply(re)

### ANS 8

In [112]:
data_7=[['A','B','C'],
        [1,2,3],
        [6,8,7],
        [2,5,8],
        [8,3,4],
        [5,1,2]
       ]

In [113]:
with open('data_7.csv','w') as f:
    writer=csv.writer(f)
    
    for i in data_7:
        writer.writerow(i)

In [3]:
pf=pd.read_csv('data_7.csv')

In [4]:
pf

   A  B  C
0  1  2  3
1  6  8  7
2  2  5  8
3  8  3  4
4  5  1  2

In [39]:
q=pf.loc[pf["A"]>5,["A"]].squeeze()
w=pf.loc[pf["B"]<10,["B"]].squeeze()
e=pf["C"].squeeze()

data={"A":q,"B":w,"C":e}

pd.DataFrame(data)

     A  B  C
0  NaN  2  3
1  6.0  8  7
2  NaN  5  8
3  8.0  3  4
4  NaN  1  2

### OR

In [43]:
def filter(pf):
    slected_row=pf[(pf["A"]>5) & (pf["B"]<10)]
    return slected_row[["A","B","C"]]

In [45]:
filter(pf)

   A  B  C
1  6  8  7
3  8  3  4

### ANS 2

In [46]:
pf

   A  B  C
0  1  2  3
1  6  8  7
2  2  5  8
3  8  3  4
4  5  1  2

In [86]:
def index(pf):
    new_index=range(1,len(pf)*2,2)
    pf.index=new_index
    return(pf)

In [87]:
index(pf)

   A  B  C
1  1  2  3
3  6  8  7
5  2  5  8
7  8  3  4
9  5  1  2

In [92]:
def index(pf):
    new_index=range(1,len(pf)*2,2)
    for i, idx in enumerate(new_index):
        pf.index.values[i]=idx
    return(pf)

In [93]:
index(pf)

   A  B  C
1  1  2  3
3  6  8  7
5  2  5  8
7  8  3  4
9  5  1  2

### ANS 4

In [163]:
word=[['sr.no','text'],
      [1,'everything is fine'],
      [2,'loop is troublesome']
     ]

In [165]:
with open('word.csv','w') as f:
    writer=csv.writer(f) 
    
    for i in word:
        writer.writerow(i)

In [169]:
df=pd.read_csv('word.csv')

In [172]:
df

   sr.no                 text
0      1   everything is fine
1      2  loop is troublesome

In [171]:
s=df['text']

In [220]:

def count(s):
    l=[]
    for i, idx in enumerate(s):
        word=len(idx.split())
        l.append(word)
    return(l)

In [221]:
count(s)

[3, 3]

In [222]:
l=[3,3]

In [223]:
df["Word_Count"]=l

In [224]:
df

   sr.no                 text  Word_Count
0      1   everything is fine           3
1      2  loop is troublesome           3

### OR

In [227]:
def count(text):
    return len(text.split())

df["World_count"]=s.apply(count)

### ANS 11

In [242]:
dates=[['sr.no','date'],
      [1,'2023-01-01'],
      [2,'2023-01-02'],
      [3,'2023-01-03'],
      [4,'2023-01-04'],
      [5,'2023-01-05']
     ]

In [243]:
with open('dates.csv','w') as f:
    writer=csv.writer(f) 
    
    for i in dates:
        writer.writerow(i)

In [245]:
pf=pd.read_csv('dates.csv')

In [246]:
pf

   sr.no        date
0      1  2023-01-01
1      2  2023-01-02
2      3  2023-01-03
3      4  2023-01-04
4      5  2023-01-05

In [250]:
s=pf['date']

In [259]:
pf['date']=pd.to_datetime(pf['date'])
s=pf['date']

In [261]:
def week():
    pf['weekdays']=s.dt.day_name()

In [262]:
weekdays()

In [263]:
pf

   sr.no       date   weekdays
0      1 2023-01-01     sunday
1      2 2023-01-02     monday
2      3 2023-01-03    tuesday
3      4 2023-01-04  wednesday
4      5 2023-01-05   thursday

### ANS 5
1) DataFrame.size() returns us the total number of elemnts presents in our dataframe 
2) dataFrame.shape() returns us the dimensions of the dataframe in the touple form

### ANS 9

In [3]:
pf1=pd.read_csv('data_1.csv')

In [4]:
pf1

     Name  values  Gender
0  Allice      25  Female
1     bob      30    male
2  claire      27  female
3     bob      54    male

In [11]:
s=pf1['values']
def cou(pf):
    Mean=s.mean()
    Median=s.median()
    standard_deviation=s.std()
    print(f'mean is {Mean} \n Median is {Median} \n standard_deviation is {standard_deviation}')

In [12]:
cou(s)

mean is 34.0
 Median is 28.5
 standard_deviation is 13.490737563232042

### ANS 12

In [19]:
data_range=pd.date_range('2023-01-01','2023-01-31')

df=pd.DataFrame({"Date":date_range})

In [20]:
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

In [22]:
s=df['Date']

In [23]:
def time(s):
    return s.timestamp()

In [24]:
df['timestamp']=s.apply(time)

In [25]:
df

         Date     timestamp
0  2023-01-01  1.672531e+09
1  2023-01-02  1.672618e+09
2  2023-01-03  1.672704e+09
3  2023-01-04  1.672790e+09
4  2023-01-05  1.672877e+09
5  2023-01-06  1.672963e+09
6  2023-01-07  1.673050e+09
7  2023-01-08  1.673136e+09
8  2023-01-09  1.673222e+09
9  2023-01-10  1.673309e+09
10 2023-01-11  1.673395e+09
11 2023-01-12  1.673482e+09
12 2023-01-13  1.673568e+09
13 2023-01-14  1.673654e+09
14 2023-01-15  1.673741e+09
15 2023-01-16  1.673827e+09
16 2023-01-17  1.673914e+09
17 2023-01-18  1.674000e+09
18 2023-01-19  1.674086e+09
19 2023-01-20  1.674173e+09
20 2023-01-21  1.674259e+09
21 2023-01-22  1.674346e+09
22 2023-01-23  1.674432e+09
23 2023-01-24  1.674518e+09
24 2023-01-25  1.674605e+09
25 2023-01-26  1.674691e+09
26 2023-01-27  1.674778e+09
27 2023-01-28  1.674864e+09
28 2023-01-29  1.674950e+09
29 2023-01-30  1.675037e+09
30 2023-01-31  1.675123e+09

In [36]:
def c(df):
    return df.loc[(df['Date']>'2023-01-21') & (df['Date']<'2023-01-30'),['Date']]

In [37]:
c(df)

         Date
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29

### ANS 10

In [60]:
date=pd.date_range('2023-01-1','2023-01-13')
data={"Sales":[1,2,3,4,5,6,7,8,9,10,11,12,13],"Date":date}

pf=pd.DataFrame(data)

In [61]:
pf['weekdays']=pf['Date'].dt.day_name()

    Sales       Date   weekdays
0       1 2023-01-01     Sunday
1       2 2023-01-02     Monday
2       3 2023-01-03    Tuesday
3       4 2023-01-04  Wednesday
4       5 2023-01-05   Thursday
5       6 2023-01-06     Friday
6       7 2023-01-07   Saturday
7       8 2023-01-08     Sunday
8       9 2023-01-09     Monday
9      10 2023-01-10    Tuesday
10     11 2023-01-11  Wednesday
11     12 2023-01-12   Thursday
12     13 2023-01-13     Friday

In [62]:
s=pf["Sales"]

In [55]:

   s.rolling(window=7,min_periods=1).mean()

In [63]:
pf['Moving_Average']=s.rolling(window=7,min_periods=1).mean()

In [64]:
pf

    Sales       Date   weekdays  Moving_Average
0       1 2023-01-01     Sunday             1.0
1       2 2023-01-02     Monday             1.5
2       3 2023-01-03    Tuesday             2.0
3       4 2023-01-04  Wednesday             2.5
4       5 2023-01-05   Thursday             3.0
5       6 2023-01-06     Friday             3.5
6       7 2023-01-07   Saturday             4.0
7       8 2023-01-08     Sunday             5.0
8       9 2023-01-09     Monday             6.0
9      10 2023-01-10    Tuesday             7.0
10     11 2023-01-11  Wednesday             8.0
11     12 2023-01-12   Thursday             9.0
12     13 2023-01-13     Friday            10.0